Autodesk.Revit.DB.Structure.AnalyticalConsistencyChecking.CheckAnalyticalConsistency(Autodesk.Revit.DB.Document)
Checks consistency of the Analytical Model.
Remarks:
Existence of inconsistencies will not affect the return value.
If inconsistencies are found, Revit will post warnings regarding those inconsistencies.
This should be run from within a transaction.
document:
Document in which to perform consistency checks.
Returns:
True if run succeeded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null